{
  "title": "Experience",
  "subtitle": "Things I worked on...",
  "experience": [
    {
      "date": "Feb 2023 - Present",
      "image": "stefanini",
      "company": "Stefanini",
      "roles": [
        {
          "position": "Software Engineer II",
          "date": "Aug 2025 - Present",
          "description": [
            "Developed an internal, user-friendly shipment tracking interface that visualizes processing status, highlights successes and failures, and enables advanced filtering. Added CSV export functionality to support operational analysis and reporting."
          ]
        },
        {
          "position": "Software Engineer I",
          "date": "Feb 2023 - Aug 2025",
          "description": [
            "Designed and implemented an ETL pipeline using AWS Lambda, SNS, SQS, and RDS to efficiently process text files from S3 bucket. Developed in Python, with GitHub for version control and SonarCloud for continuous code quality analysis.",
            "Configured AWS API Gateway and developed AWS Lambda functions in Python and Java to handle shipment processing, including validation, creation, voiding, and price estimation, ensuring efficiency and scalability.",
            "Designed and implemented an intuitive website for a LLM initiative and enhanced visual elements using React, TypeScript, CSS, and Material-UI. Incorporated authentication through Azure.",
            "Engineered user-friendly web interfaces using React, TypeScript, CSS and AWS services to provide real-time insights for efficient monitoring and optimization of Lambda function performance."
          ]
        }
      ]
    },
    {
      "date": "May 2022 - Aug 2022",
      "image": "tableau",
      "company": "Tableau",
      "roles": [
        {
          "position": "Software Engineer Intern",
          "description": [
            "Created tables, procedures, and tasks in Snowflake, incorporating integrations and external stages to extract data from AWS S3 bucket and efficiently export it to Tableau Cloud, thereby significantly improving debugging capabilities and streamlining data analysis processes.",
            "Created automated CloudWatch dashboards through Terraform and designed detailed graphs in Tableau Cloud to optimize AWS SES events monitoring."
          ]
        }
      ]
    },
    {
      "date": "Sep 2020 - Apr 2022",
      "image": "ttu",
      "company": "Texas Tech University",
      "roles": [
        {
          "position": "Undergraduate Student Researcher",
          "description": [
            "Built a cost-efficient hand prosthetic proof-of-concept using servo motors and Arduino Uno, integrated with Google AMR technology to control the hand by voice commands."
          ]
        }
      ]
    },
    {
      "date": "Jan 2019 - Jul 2019",
      "image": "resource",
      "company": "Resource IT Solutions",
      "roles": [
        {
          "position": "Software Engineer Intern",
          "description": [
            "Debugged and enhanced API functionality in pair programming development of Movida Car Rental’s digital totem while also documenting the APIs for expanded resources, leveraging my expertise in Java, HTML and CSS."
          ]
        }
      ]
    }
  ]
}
